balazsgrill/modembed/res/Devices/dsPIC33/PIC24HJ128GP306A.PIC
      <edc:DCRDef edc:access="--------nn--nnnn" edc:cname="FSS" edc:default="0xcf" edc:desc="" edc:impl="0xcf" edc:name="FSS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xcf">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SWRP" edc:desc="Secure Segment Program Write Protect" edc:mask="0x1" edc:name="SWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WRPROTECT_OFF" edc:codeguardidref="PgmSecureWrtProtectOff" edc:desc="Secure segment may be written" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WRPROTECT_ON" edc:codeguardidref="PgmSecureWrtProtectOn" edc:desc="Secure segment is write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SSS" edc:desc="Secure Segment Program Flash Code Protection" edc:mask="0x7" edc:name="SSS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="NO_FLASH" edc:codeguardidref="PgmSecureNone" edc:desc="No Secure Segment" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="NO_SEC_CODE" edc:codeguardidref="NoSecCode" edc:desc="No Secure Segment" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_FLASH_STD" edc:codeguardidref="PgmSecureStdSm" edc:desc="Standard Security, Small-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="STRD_SMALL_SEC_CODE" edc:codeguardidref="StdSmSecCode" edc:desc="Standard Security, Small-sized Secure Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_FLASH_STD" edc:codeguardidref="PgmSecureStdMed" edc:desc="Standard Security, Medium-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="STRD_MEDIUM_SEC_CODE" edc:codeguardidref="StdMedSecCode" edc:desc="Standard Security, Medium-sized Secure Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_FLASH_STD" edc:codeguardidref="PgmSecureStdLarge" edc:desc="Standard Security, Large-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="STRD_LARGE_SEC_CODE" edc:codeguardidref="StdLarSecCode" edc:desc="Standard Security, Large-sized Secure Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="" edc:desc="No Secure Segment" edc:islanghidden="true" edc:when="(field &amp; 0x7) == 0x3" edcisidehidden="true"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_FLASH_HIGH" edc:codeguardidref="PgmSecureHighSm" edc:desc="High Security, Small-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_SMALL_SEC_CODE" edc:codeguardidref="HiSmSecCode" edc:desc="High Security, Small-sized Secure Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_FLASH_HIGH" edc:codeguardidref="PgmSecureHighMed" edc:desc="High Security, Medium-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_MEDIUM_SEC_CODE" edc:codeguardidref="HiMedSecCode" edc:desc="High Security, Medium-sized Secure Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_FLASH_HIGH" edc:codeguardidref="PgmSecureHighLarge" edc:desc="High Security, Large-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_LARGE_SEC_CODE" edc:codeguardidref="HiLarSecCode" edc:desc="High Security, Large-sized Secure Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="RSS" edc:desc="Secure Segment Data RAM Protection" edc:mask="0x3" edc:name="RSS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NO_RAM" edc:codeguardidref="DataSecureNone" edc:desc="No Secure RAM" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="NO_SEC_RAM" edc:codeguardidref="NoSecRam" edc:desc="No Secure RAM" edc:isidehidden="true" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_RAM" edc:codeguardidref="DataSecureSmall" edc:desc="Small-sized Secure RAM" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_SEC_RAM" edc:codeguardidref="SmallSecRam" edc:desc="Small-sized Secure RAM" edc:isidehidden="true" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_RAM" edc:codeguardidref="DataSecureMed" edc:desc="Medium-sized Secure RAM" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_SEC_RAM" edc:codeguardidref="MedSecRam" edc:desc="Medium-sized Secure RAM" edc:isidehidden="true" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_RAM" edc:codeguardidref="DataSecureLarge" edc:desc="Large-sized Secure RAM" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_SEC_RAM" edc:codeguardidref="LarSecRam" edc:desc="Large-sized Secure RAM" edc:isidehidden="true" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES" edc:desc="Reserved" edc:ishidden="true" edc:mask="0xff" edc:name="RES" edc:nzwidth="0x8">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x0) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-------------nnn" edc:cname="FGS" edc:default="0x7" edc:desc="" edc:impl="0x7" edc:name="FGS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="GWRP" edc:desc="General Code Segment Write Protect" edc:mask="0x1" edc:name="GWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenWrtProtectOff" edc:desc="User program memory is not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenWrtProtectOn" edc:desc="User program memory is write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GSS" edc:desc="General Segment Code Protection" edc:mask="0x3" edc:name="GSS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenNone" edc:desc="User program memory is not code-protected" edc:when="(field &amp; 0x3) == 0x3">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_OFF"/>
                  <edc:LegacyAlias edc:cname="GCP_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenStd" edc:desc="Standard Security Code Protection is Enabled" edc:when="(field &amp; 0x3) == 0x2">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x15800"/>
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_STD"/>
                  <edc:LegacyAlias edc:cname="GCP_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HIGH" edc:codeguardidref="PgmGenHigh" edc:desc="High Security Code Protection is Enabled" edc:when="(field &amp; 0x3) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x15800"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
